programming.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Programming by Toby Dylan Hocking, PhD</title>
<!-- 2015-12-03 Thu 16:15 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Toby Dylan Hocking" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Programming by Toby Dylan Hocking, PhD</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Email: tdhock5@gmail.com</a></li>
<li><a href="#sec-2">Programming consulting services</a></li>
<li><a href="#sec-3">Progamming software products</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Email: tdhock5@gmail.com</h2>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Programming consulting services</h2>
<div class="outline-text-2" id="text-2">
<p>
I am an expert programmer of R packages and Python modules for
analyzing big data sets.
</p>

<p>
I am available for hire as a consultant for:
</p>
<ul class="org-ul">
<li>Programming new R packages or Python modules (including C/C++
code). Send me a description of what you want the code to do, and I
will write the program for you (along with test cases and
documentation).
</li>
<li>Re-writing existing packages to minimize execution time and memory
usage. Is your existing code too slow or too memory-intensive for
your big data sets? Send me your code and I will use benchmarking
tools to find the bottlenecks, then re-write the parts necessary to
get the performance you need.
</li>
<li>Teaching you how to write optimized code (R, Python, C, C++, regular
expressions). Explain to me what kinds of problems you would like
to solve, and I will create a custom seminar for your particular
needs. <a href="https://github.com/tdhock/tutorials#programming-for-data-analysis">List of previous teaching about programming for data
analysis</a>.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Progamming software products</h2>
<div class="outline-text-2" id="text-3">
<p>
I have written several free/open-source software packages for
programming with data.
</p>
<ul class="org-ul">
<li>I wrote the C code that interfaces R with the <a href="http://pcre.org/">Perl-Compatible
Regular Expressions</a> library, and permits named capture regular
expressions (<a href="https://bugs.r-project.org/bugzilla3/show_bug.cgi?id%3D14518">patch</a>). My code has been distributed with every copy of
R since version 2.14 in 2011.
</li>
<li><a href="https://github.com/tdhock/namedCapture">namedCapture</a> is an R package which provides a convenient output
format for data extracted using a named capture regular expression.
</li>
<li>I designed and implemented the part of the <a href="https://github.com/ropensci/plotly">plotly</a> package which
converts a ggplot (an R object) to a JSON file for upload to the
<a href="https://plot.ly/">plot.ly</a> server.
</li>
<li><a href="https://github.com/tdhock/memtime">memtime</a> can be used for memory benchmarking R code.
</li>
<li>I implmented the str.extractall method for named capture regular
expressions in <a href="http://pandas.pydata.org/">pandas</a> (<a href="https://github.com/pydata/pandas/pull/11386">PR</a>).
</li>
<li><a href="https://github.com/tdhock/requireGitHub">requireGitHub</a> can be used to record and install any version of any R
package on GitHub, thus facilitating reproducible computations.
</li>
<li><a href="https://github.com/tdhock/revector">revector</a> is an R package with C code for vectors of regular
expressions.
</li>
<li><a href="https://github.com/tdhock/inlinedocs">inlinedocs</a> makes it easy to maintain R package documentation, by
converting comments in R code to documentation files (Rd).
</li>
</ul>
<p>
I am available for hire for teaching you about these software
packages.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Toby Dylan Hocking</p>
<p class="date">Created: 2015-12-03 Thu 16:15</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 23.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.5c)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
